export default {
  装备基础属性: {
    等级: 120,
    基础攻击: 0,
    破防等级: 0,
    无双等级: 0,
    会心等级: 0,
    会心效果等级: 0,
    全能等级: 0,
    武器伤害_最小值: 0,
    武器伤害_最大值: 0,
    破招值: 0,
    力道: 41,
    元气: 41,
    身法: 0,
    根骨: 41,
    体质: 0,
    加速等级: 974,
  },
  装备列表: [
    {
      当前精炼等级: 6,
      装备部位: '帽子',
      附魔: '破招+974',
      镶嵌孔数组: [
        {
          镶嵌类型: 'atAgilityBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atPhysicsAttackPowerBase',
          镶嵌宝石等级: 8,
        },
      ],
      id: 98317,
    },
    {
      当前精炼等级: 6,
      装备部位: '衣服',
      附魔: '无双+291',
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsCriticalStrike',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atPhysicsCriticalDamagePowerBase',
          镶嵌宝石等级: 8,
        },
      ],
      id: 98347,
    },
    {
      当前精炼等级: 6,
      装备部位: '腰带',
      附魔: '无双+291',
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsCriticalStrike',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atPhysicsAttackPowerBase',
          镶嵌宝石等级: 8,
        },
      ],
      id: 98257,
    },
    {
      当前精炼等级: 3,
      装备部位: '护腕',
      附魔: '破防+974',
      镶嵌孔数组: [
        {
          镶嵌类型: 'atSurplusValueBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atPhysicsOvercomeBase',
          镶嵌宝石等级: 8,
        },
      ],
      id: 98455,
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsCriticalDamagePowerBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atPhysicsAttackPowerBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 3,
      id: 98465,
      装备部位: '下装',
      附魔: '破防+974',
    },
    {
      当前精炼等级: 6,
      装备部位: '鞋子',
      附魔: '破招+974',
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsAttackPowerBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atPhysicsOvercomeBase',
          镶嵌宝石等级: 8,
        },
      ],
      id: 98287,
    },
    {
      当前精炼等级: 6,
      装备部位: '项链',
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsAttackPowerBase',
          镶嵌宝石等级: 8,
        },
      ],
      id: 39909,
    },
    {
      当前精炼等级: 4,
      装备部位: '腰坠',
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsOvercomeBase',
          镶嵌宝石等级: 8,
        },
      ],
      id: 39855,
    },
    {
      当前精炼等级: 3,
      装备部位: '戒指',
      附魔: '破招+974',
      镶嵌孔数组: [],
      id: 39863,
    },
    {
      当前精炼等级: 3,
      装备部位: '戒指',
      附魔: '破招+974',
      镶嵌孔数组: [],
      id: 39863,
    },
    {
      当前精炼等级: 3,
      装备部位: '暗器',
      附魔: '加速+974',
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsCriticalStrike',
          镶嵌宝石等级: 8,
        },
      ],
      id: 37188,
    },
    {
      镶嵌孔数组: [
        {
          镶嵌类型: 'atPhysicsAttackPowerBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atAgilityBase',
          镶嵌宝石等级: 8,
        },
        {
          镶嵌类型: 'atPhysicsOvercomeBase',
          镶嵌宝石等级: 8,
        },
      ],
      当前精炼等级: 4,
      id: 37229,
      装备部位: '武器',
      附魔: '攻击+439',
    },
  ],
  五彩石: '彩·瞬影·斩铁·痛击(陆)',
  装备增益: {
    大附魔_伤帽: 1,
    大附魔_伤衣: 1,
    大附魔_伤腰: 1,
    大附魔_伤腕: 1,
    大附魔_伤鞋: 1,
    风特效腰坠_英雄: true,
    水特效武器_英雄: true,
    套装会心会效: true,
    套装技能: 1,
    切糕会心: false,
    切糕无双: false,
    切糕会心_英雄: false,
    切糕无双_英雄: false,
    冬至套装: false,
  },
}
