export default [
  {
    version: '[雾海寻龙] 1.0.2',
    date: '2024-07-08 11:00:00',
    content: [
      '更新',
      <p style={{ paddingLeft: 12 }} key='1.1.0.1'>
        <p>1- 增加了大家需要的全能满品暗器</p>
        <p>2- 根据当日技改 非侠从13%提升至15%</p>
        <p>3- 当前并未计算剑纯自己开阵的四阵收益 欢迎同门提供含四阵回豆的木桩JCL</p>
      </p>,
    ],
  },
  {
    version: '[雾海寻龙] 1.0.1',
    date: '2024-07-05 17:00:00',
    content: [
      '更新',
      <p style={{ paddingLeft: 12 }} key='1.1.0.1'>
        <p>1- 战斗时间进行了更改</p>
        <p>2- 修复剑鸣问题</p>
        <p>3- 修复了智能配装界面 更新了两套无弘法配装</p>
      </p>,
    ],
  },
  {
    version: '[雾海寻龙] 1.0.0',
    date: '2024-07-04 22:00:00',
    content: [
      '综合',
      <p style={{ paddingLeft: 12 }} key='1.1.0.1'>
        <p>- 计算器由唐宋开源框架编写</p>
        <p>- 精准系数由考拉提供</p>
        <p>- 由于一些历史遗留问题 经开源者允许单独发布</p>
      </p>,
    ],
  },

]
